eclipse-threadx/getting-started/NXP/MIMXRT1050-EVKB/lib/MIMXRT1050-evk/src/components/video/camera/device/mt9m114/fsl_mt9m114.h
/*
 * Copyright  2017-2018 NXP
 * All rights reserved.
 *
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#ifndef _FSL_MT9M114_H_
#define _FSL_MT9M114_H_

#include "fsl_common.h"
#include "fsl_camera_device.h"
#include "fsl_video_i2c.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
#define MT9M114_I2C_ADDR 0x48
#define MT9M114_CHIP_ID  0x2481

/*! @brief MT9M114 register definitions.*/

/* 1.Core registers */
#define MT9M114_REG_Y_ADDR_START            0x3002
#define MT9M114_REG_X_ADDR_START            0x3004
#define MT9M114_REG_Y_ADDR_END              0x3006
#define MT9M114_REG_X_ADDR_END              0x3008
#define MT9M114_REG_FRAME_LENGTH_LINES      0x300A
#define MT9M114_REG_LINE_LENGTH_PCK_        0x300C
#define MT9M114_REG_COARSE_INTEGRATION_TIME 0x3012
#define MT9M114_REG_FINE_INTEGRATION_TIME   0x3014
#define MT9M114_REG_RESET_REGISTER          0x301A
#define MT9M114_REG_FLASH                   0x3046
#define MT9M114_REG_FLASH_COUNT             0x3048
#define MT9M114_REG_GREEN1_GAIN             0x3056
#define MT9M114_REG_BLUE_GAIN               0x3058
#define MT9M114_REG_RED_GAIN                0x305A
#define MT9M114_REG_GREEN2_GAIN             0x305C
#define MT9M114_REG_GLOBAL_GAIN             0x305E
#define MT9M114_REG_FUSE_ID1                0x31F4
#define MT9M114_REG_FUSE_ID2                0x31F6
#define MT9M114_REG_FUSE_ID3                0x31F8
#define MT9M114_REG_FUSE_ID4                0x31FA
#define MT9M114_REG_CHAIN_CONTROL           0x31FC
#define MT9M114_REG_CUSTOMER_REV            0x31FE

/* 2.SOC1 registers */
#define MT9M114_REG_COLOR_PIPELINE_CONTROL 0x3210

/* 3.SOC2 registers */
#define MT9M114_REG_P_G1_P0Q0     0x3640
#define MT9M114_REG_P_G1_P0Q1     0x3642
#define MT9M114_REG_P_G1_P0Q2     0x3644
#define MT9M114_REG_P_G1_P0Q3     0x3646
#define MT9M114_REG_P_G1_P0Q4     0x3648
#define MT9M114_REG_P_R_P0Q0      0x364A
#define MT9M114_REG_P_R_P0Q1      0x364C
#define MT9M114_REG_P_R_P0Q2      0x364E
#define MT9M114_REG_P_R_P0Q3      0x3650
#define MT9M114_REG_P_R_P0Q4      0x3652
#define MT9M114_REG_P_B_P0Q0      0x3654
#define MT9M114_REG_P_B_P0Q1      0x3656
#define MT9M114_REG_P_B_P0Q2      0x3658
#define MT9M114_REG_P_B_P0Q3      0x365A
#define MT9M114_REG_P_B_P0Q4      0x365C
#define MT9M114_REG_P_G2_P0Q0     0x365E
#define MT9M114_REG_P_G2_P0Q1     0x3660
#define MT9M114_REG_P_G2_P0Q2     0x3662
#define MT9M114_REG_P_G2_P0Q3     0x3664
#define MT9M114_REG_P_G2_P0Q4     0x3666
#define MT9M114_REG_P_G1_P1Q0     0x3680
#define MT9M114_REG_P_G1_P1Q1     0x3682
#define MT9M114_REG_P_G1_P1Q2     0x3684
#define MT9M114_REG_P_G1_P1Q3     0x3686
#define MT9M114_REG_P_G1_P1Q4     0x3688
#define MT9M114_REG_P_R_P1Q0      0x368A
#define MT9M114_REG_P_R_P1Q1      0x368C
#define MT9M114_REG_P_R_P1Q2      0x368E
#define MT9M114_REG_P_R_P1Q3      0x3690
#define MT9M114_REG_P_R_P1Q4      0x3692
#define MT9M114_REG_P_B_P1Q0      0x3694
#define MT9M114_REG_P_B_P1Q1      0x3696
#define MT9M114_REG_P_B_P1Q2      0x3698
#define MT9M114_REG_P_B_P1Q3      0x369A
#define MT9M114_REG_P_B_P1Q4      0x369C
#define MT9M114_REG_P_G2_P1Q0     0x369E
#define MT9M114_REG_P_G2_P1Q1     0x36A0
#define MT9M114_REG_P_G2_P1Q2     0x36A2
#define MT9M114_REG_P_G2_P1Q3     0x36A4
#define MT9M114_REG_P_G2_P1Q4     0x36A6
#define MT9M114_REG_P_G1_P2Q0     0x36C0
#define MT9M114_REG_P_G1_P2Q1     0x36C2
#define MT9M114_REG_P_G1_P2Q2     0x36C4
#define MT9M114_REG_P_G1_P2Q3     0x36C6
#define MT9M114_REG_P_G1_P2Q4     0x36C8
#define MT9M114_REG_P_R_P2Q0      0x36CA
#define MT9M114_REG_P_R_P2Q1      0x36CC
#define MT9M114_REG_P_R_P2Q2      0x36CE
#define MT9M114_REG_P_R_P2Q3      0x36D0
#define MT9M114_REG_P_R_P2Q4      0x36D2
#define MT9M114_REG_P_B_P2Q0      0x36D4
#define MT9M114_REG_P_B_P2Q1      0x36D6
#define MT9M114_REG_P_B_P2Q2      0x36D8
#define MT9M114_REG_P_B_P2Q3      0x36DA
#define MT9M114_REG_P_B_P2Q4      0x36DC
#define MT9M114_REG_P_G2_P2Q0     0x36DE
#define MT9M114_REG_P_G2_P2Q1     0x36E0
#define MT9M114_REG_P_G2_P2Q2     0x36E2
#define MT9M114_REG_P_G2_P2Q3     0x36E4
#define MT9M114_REG_P_G2_P2Q4     0x36E6
#define MT9M114_REG_P_G1_P3Q0     0x3700
#define MT9M114_REG_P_G1_P3Q1     0x3702
#define MT9M114_REG_P_G1_P3Q2     0x3704
#define MT9M114_REG_P_G1_P3Q3     0x3706
#define MT9M114_REG_P_G1_P3Q4     0x3708
#define MT9M114_REG_P_R_P3Q0      0x370A
#define MT9M114_REG_P_R_P3Q1      0x370C
#define MT9M114_REG_P_R_P3Q2      0x370E
#define MT9M114_REG_P_R_P3Q3      0x3710
#define MT9M114_REG_P_R_P3Q4      0x3712
#define MT9M114_REG_P_B_P3Q0      0x3714
#define MT9M114_REG_P_B_P3Q1      0x3716
#define MT9M114_REG_P_B_P3Q2      0x3718
#define MT9M114_REG_P_B_P3Q3      0x371A
#define MT9M114_REG_P_B_P3Q4      0x371C
#define MT9M114_REG_P_G2_P3Q0     0x371E
#define MT9M114_REG_P_G2_P3Q1     0x3720
#define MT9M114_REG_P_G2_P3Q2     0x3722
#define MT9M114_REG_P_G2_P3Q3     0x3724
#define MT9M114_REG_P_G2_P3Q4     0x3726
#define MT9M114_REG_P_G1_P4Q0     0x3740
#define MT9M114_REG_P_G1_P4Q1     0x3742
#define MT9M114_REG_P_G1_P4Q2     0x3744
#define MT9M114_REG_P_G1_P4Q3     0x3746
#define MT9M114_REG_P_G1_P4Q4     0x3748
#define MT9M114_REG_P_R_P4Q0      0x374A
#define MT9M114_REG_P_R_P4Q1      0x374C
#define MT9M114_REG_P_R_P4Q2      0x374E
#define MT9M114_REG_P_R_P4Q3      0x3750
#define MT9M114_REG_P_R_P4Q4      0x3752
#define MT9M114_REG_P_B_P4Q0      0x3754
#define MT9M114_REG_P_B_P4Q1      0x3756
#define MT9M114_REG_P_B_P4Q2      0x3758
#define MT9M114_REG_P_B_P4Q3      0x375A
#define MT9M114_REG_P_B_P4Q4      0x375C
#define MT9M114_REG_P_G2_P4Q0     0x375E
#define MT9M114_REG_P_G2_P4Q1     0x3760
#define MT9M114_REG_P_G2_P4Q2     0x3762
#define MT9M114_REG_P_G2_P4Q3     0x3764
#define MT9M114_REG_P_G2_P4Q4     0x3766
#define MT9M114_REG_CENTER_ROW    0x3782
#define MT9M114_REG_CENTER_COLUMN 0x3784

/* 4.SYSCTL registers */
#define MT9M114_REG_CHIP_ID                        0x0000
#define MT9M114_REG_CLOCKS_CONTROL                 0x0016
#define MT9M114_REG_RESET_AND_MISC_CONTROL         0x001A
#define MT9M114_REG_PAD_SLEW                       0x001E
#define MT9M114_REG_USER_DEFINED_DEVICE_ADDRESS_ID 0x002E
#define MT9M114_REG_PAD_CONTROL                    0x0032
#define MT9M114_REG_COMMAND_REGISTER               0x0080

/* 5.XDMA registers */
#define MT9M114_REG_ACCESS_CTL_STAT         0x0982
#define MT9M114_REG_PHYSICAL_ADDRESS_ACCESS 0x098A
#define MT9M114_REG_LOGICAL_ADDRESS_ACCESS  0x098E
#define MT9M114_REG_MCU_VARIABLE_DATA0      0x0990
#define MT9M114_REG_MCU_VARIABLE_DATA1      0x0992
#define MT9M114_REG_MCU_VARIABLE_DATA2      0x0994
#define MT9M114_REG_MCU_VARIABLE_DATA3      0x0996
#define MT9M114_REG_MCU_VARIABLE_DATA4      0x0998
#define MT9M114_REG_MCU_VARIABLE_DATA5      0x099A
#define MT9M114_REG_MCU_VARIABLE_DATA6      0x099C
#define MT9M114_REG_MCU_VARIABLE_DATA7      0x099E

/*! @brief MT9M114 variables definitions.*/

/* 01.Monitor variables */
#define MT9M114_VAR_MON_MAJOR_VERSION   0x8000
#define MT9M114_VAR_MON_MINOR_VERSION   0x8002
#define MT9M114_VAR_MON_RELEASE_VERSION 0x8004
#define MT9M114_VAR_MON_HEARTBEAT       0x8006

