eclipse-threadx/getting-started/NXP/MIMXRT1050-EVKB/lib/MIMXRT1050-evk/src/components/video/camera/device/mt9m114/fsl_mt9m114.h
/* 12.PatchLoader variables */
#define MT9M114_VAR_PATCHLDR_LOADER_ADDRESS 0xE000
#define MT9M114_VAR_PATCHLDR_PATCH_ID       0xE002
#define MT9M114_VAR_PATCHLDR_FIRMWARE_ID    0xE004
#define MT9M114_VAR_PATCHLDR_APPLY_STATUS   0xE008
#define MT9M114_VAR_PATCHLDR_NUM_PATCHES    0xE009
#define MT9M114_VAR_PATCHLDR_PATCH_ID_0     0xE00A
#define MT9M114_VAR_PATCHLDR_PATCH_ID_1     0xE00C
#define MT9M114_VAR_PATCHLDR_PATCH_ID_2     0xE00E
#define MT9M114_VAR_PATCHLDR_PATCH_ID_3     0xE010
#define MT9M114_VAR_PATCHLDR_PATCH_ID_4     0xE012
#define MT9M114_VAR_PATCHLDR_PATCH_ID_5     0xE014
#define MT9M114_VAR_PATCHLDR_PATCH_ID_6     0xE016
#define MT9M114_VAR_PATCHLDR_PATCH_ID_7     0xE018

/* 13.Patch variables */
#define MT9M114_VAR_PATCHVARS_DELTA_DK_CORRECTION_FACTOR 0xE400

/* 14.CommandHandler variables */
#define MT9M114_VAR_CMD_HANDLER_WAIT_EVENT_ID 0xFC00
#define MT9M114_VAR_CMD_HANDLER_NUM_EVENTS    0xFC02

/*! @brief MT9M114 command definitions. */
#define MT9M114_COMMAND_APPLY_PATCH    0x0001
#define MT9M114_COMMAND_SET_STATE      0x0002
#define MT9M114_COMMAND_REFRESH        0x0004
#define MT9M114_COMMAND_WAIT_FOR_EVENT 0x0008
#define MT9M114_COMMAND_OK             0x8000

/*! @brief MT9M114 system state definitions. */
#define MT9M114_SYS_STATE_ENTER_CONFIG_CHANGE 0x28
#define MT9M114_SYS_STATE_STREAMING           0x31
#define MT9M114_SYS_STATE_START_STREAMING     0x34
#define MT9M114_SYS_STATE_ENTER_SUSPEND       0x40
#define MT9M114_SYS_STATE_SUSPENDED           0x41
#define MT9M114_SYS_STATE_ENTER_STANDBY       0x50
#define MT9M114_SYS_STATE_STANDBY             0x52
#define MT9M114_SYS_STATE_LEAVE_STANDBY       0x54

/*! @brief MT9M114 system set-state command retults. */
#define MT9M114_SYS_STATE_SET_RESULT_ENOERR 0x00 /* command successful */
#define MT9M114_SYS_STATE_SET_RESULTEINVAL  0x0C /* invalid configuration */
#define MT9M114_SYS_STATE_SET_RESULTENOSPC  0x0D /* resource not available */

/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*!
 * @brief MT9M114 resource.
 *
 * Before initialize the MT9M114, the resource must be initialized that the
 * Two-Wire-Serial-Interface I2C could start to work.
 */
typedef struct _mt9m114_resource
{
    video_i2c_send_func_t i2cSendFunc;       /*!< I2C send function. */
    video_i2c_receive_func_t i2cReceiveFunc; /*!< I2C receive function. */
    void (*pullResetPin)(bool pullUp);       /*!< Function to pull reset pin high or low. */
    uint32_t inputClockFreq_Hz;              /*!< Input clock frequency, EXTCLK. */
} mt9m114_resource_t;

/*! @brief MT9M114 operation functions. */
extern const camera_device_operations_t mt9m114_ops;

/*******************************************************************************
 * API
 ******************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

#if defined(__cplusplus)
}
#endif

#endif /* _FSL_MT9M114_H_ */
